БПКР/src/DataProcessors/ПодборСотрудника/ПодборСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПодборСотрудника</name>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьУволенных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторФормыВладельца</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокПодобранных</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВедомости</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Корзина</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>БанковскийСчет</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>КартСчет</name>
      <type>
        <types>CatalogRef.КартСчетаСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

БПКР/src/DataProcessors/ПодборСотрудника/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает структуру с параметрами обработки подбора
//
// Используется для кеширования
//
Процедура СтруктураСведенийОДокументе(СтруктураПараметров) Экспорт
	
	СтруктураПараметров = Новый Структура;
	
	Для каждого РеквизитОбработки Из Метаданные.Обработки.ПодборСотрудника.Реквизиты Цикл
		СтруктураПараметров.Вставить(РеквизитОбработки.Имя);
	КонецЦикла;
	
КонецПроцедуры // СтруктураПараметровПодбора()

// Проверяем минимальный уровень заполнение параметров
//
Процедура ПроверитьЗаполнениеПараметров(ПараметрыПодбора, Отказ) Экспорт
	Перем Ошибки;
	
	СтруктураОбязательныхПараметров = СтруктураОбязательныхПараметров();
	
	Для каждого ЭлементСтруктуры Из СтруктураОбязательныхПараметров Цикл
		
		ЗначениеПараметров = Неопределено;
		Если НЕ ПараметрыПодбора.Свойство(ЭлементСтруктуры.Ключ, ЗначениеПараметров) Тогда
			
			ТекстОшибки = НСтр("ru = 'Отсутствует обязательный параметр (%1), необходимый для открытия формы подбора.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ЭлементСтруктуры.Значение);
			
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "", ТекстОшибки, Неопределено);
			
		ИначеЕсли НЕ ЗначениеЗаполнено(ЗначениеПараметров) Тогда
			
			ТекстОшибки = НСтр("ru = 'Неверно заполнен обязательный параметр (%1), необходимый для открытия формы подбора.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ЭлементСтруктуры.Значение);
			
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "", ТекстОшибки, Неопределено);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры // ПроверитьЗаполнениеПараметров()

// Функция возвращает полное имя формы подбора 
//
Функция ПолноеИмяФормыПодбора() Экспорт
	
	Возврат "Обработка.ПодборСотрудника.Форма.Корзина";
	
КонецФункции // ПолноеИмяФормыПодбора()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает структуру обязательных параметров
//
Функция СтруктураОбязательныхПараметров()
	
	Возврат Новый Структура("Дата, Организация, УникальныйИдентификаторФормыВладельца", 
		"Дата", 
		"Организация", 
		"Уникальный идентификатор формы владельца");
	
КонецФункции // СтруктураОбязательныхПараметров()

#КонецОбласти

#КонецЕсли
